<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class BookTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //Повість розпочинається з того, що оповідачка розказує про свою гірку недолю: не знає вона своїх батька та матері, змалку у неволі. Але вона на те не зважає — не можна ж людині весь час журитися. За старої пані дівчата у дворі жили спокійно, не дозволяла вона тільки виходити нікуди, навіть до церкви у неділю. Хіба що на велике свято. Зате не била, не знущалася, бо була вже стара. Кожен день шили дівчата у своїм покої. Інколи було зовсім нудно, інколи ж чомусь розвеселяться вони. У старої була онучка, яка вчилася в інституті. Через деякий час повідомила панночка, щоб забирали її. Почалися приготування.
        DB::table('books')->insert([
            [
                'title' => 'Институтка',
                'description' => 'Повість розпочинається з того, що оповідачка розказує про свою гірку недолю:
                не знає вона своїх батька та матері, змалку у неволі. Але вона на те не зважає — не можна ж людині весь час журитися.
                 За старої пані дівчата у дворі жили спокійно, не дозволяла вона тільки виходити нікуди, навіть до церкви у неділю.
                 Хіба що на велике свято. Зате не била, не знущалася, бо була вже стара. Кожен день шили дівчата у своїм покої.
                 Інколи було зовсім нудно, інколи ж чомусь розвеселяться вони. У старої була онучка, яка вчилася в інституті.
                 Через деякий час повідомила панночка, щоб забирали її. Почалися приготування.',
                'author_id' => 4,
                'image' => 'images/Институтка.jpeg'
            ],
            [
                'title' => 'Энеида',
                'description' => 'После падения Трои Эней собирает товарищей и отправляется в морской поход.
                Юнона, которая не любит Энея за то, что тот является сыном Венеры, спешит к богу ветров Эолу и просит его уничтожить
                Энея и всю его дружину. Эол не может отказать молодой красавице и велит ветрам взбудоражить море, что они и делают.
                Но Нептун по просьбе Энея (за немалую по тем временам сумму) укоряет ветрам и успокаивает море.
                Между тем Венера отправляется к Зевсу с просьбой про опеку над еë сыном. ',
                'author_id' => 1,
                'image' => 'images/Енеида.jpg'
            ],
            [
                'title' => 'Кобзар',
                'description' => 'Чи є хоча б один українець, що не чув про Тараса Шевченка? Напевно,
                таких немає. Адже Тарас Шевченко став ідолом української літератури,
                 духовним пророком і воїном, чиї вірші і досі залишаються актуальними і популярними.',
                'author_id' => 2,
                'image' => 'images/Кобзар.jpg'
            ],
            [
                'title' => 'На крыльях песен',
                'description' => 'Первый сборник поэтических произведений Леси Украинки «На крыльях песен» издан во Львове в начале 1893 г.
                 В издании сборника принимал непосредственное участие И. Франко. Ему посылала Леся Украинка
                 частями рукопись сборника, он присматривал за составлением книги в типографии Научного общества им.
                 Шевченко. В библиотеке НТШ сохранилась часть наборного экземпляра рукописи сборника
                 (Институт литературы им. Т. Г. Шевченко НАН Украины, ф 2, № 747).',
                'author_id' => 3,
                'image' => 'images/На_крыльях_песен.jpg'
            ],
            [
                'title' => 'Захар Беркут',
                'description' => 'обытия, описанные в книге, происходят в 1241 году. Боярин Тугар Волк приезжает с
                дочерью Мирославой в Тухольщину на Карпатах, где князь Даниил подарил ему земли. Максим,
                сын местного старейшины Захара Беркута, и боярская дочь влюбились друг в друга,
                но Тугар Волк категорически против их отношений.',
                'author_id' => 5,
                'image' => 'images/Zahar_Berkut.jpg'
            ]
        ]);
    }
}
